taskt/Core/Automation/Commands/ExcelGroup/IExcelColumnRangeSetProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IExcelColumnRangeSetProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.AExcelColumnRangeSetCommands" [ label="AExcelColumnRangeSetCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelColumnRangeSetProperties" [ label="IExcelColumnRangeSetProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ExcelSetColumnValuesFromDataTableCommand" [ label="ExcelSetColumnValuesFromDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelSetColumnValuesFromDictionaryCommand" [ label="ExcelSetColumnValuesFromDictionaryCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelSetColumnValuesFromListCommand" [ label="ExcelSetColumnValuesFromListCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.AExcelColumnRangeSetCommands" -> "taskt.Core.Automation.Commands.IExcelColumnRangeSetProperties";
"taskt.Core.Automation.Commands.ExcelSetColumnValuesFromDataTableCommand" -> "taskt.Core.Automation.Commands.AExcelColumnRangeSetCommands";
"taskt.Core.Automation.Commands.ExcelSetColumnValuesFromDictionaryCommand" -> "taskt.Core.Automation.Commands.AExcelColumnRangeSetCommands";
"taskt.Core.Automation.Commands.ExcelSetColumnValuesFromListCommand" -> "taskt.Core.Automation.Commands.AExcelColumnRangeSetCommands";
}
